of90/tutorials/rheoFoam/OtherTests/tube_GNF/Casson/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type            Casson;
                
                rho             rho   [1 -3 0 0 0 0 0] 1050; 
   		tau0            tau0  [ 1 -1 -2 0 0 0 0 ] .01082; 
   		etaInf          etaInf     [ 1 -1 -1 0 0 0 0 ] .004; 
   		 
   		PapanastasiouRegularization true;   
   		m               m     [ 0 0 1 0 0 0 0 ] 1000;         
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
